//////////////二叉树的遍历////////////////
//广度优先遍历
/*
	从左至右，从上至下，遍历完一层再遍历下一层

*/
//深度优先遍历
/*
	先序遍历序列：第一次来到某个结点时访问/根左右

	中序遍历序列：第二次来到某个结点时访问/左根右

	后序遍历序列：第三次来到某个结点时访问/左右根

*/

/////////////树的深度优先遍历////////////////
/*由于树可以有多个结点，所以它只有先序遍历和后序遍历。没有中序遍历的原因就是会产生歧义。*/


///////////树与二叉树遍历的关系/////////////////
/*
	如果一个二叉树是由一个树转换而来的，对这个二叉树进行先序遍历=对原来的树进行先序遍历
	对此二叉树进行中序遍历=对原来的树进行后序遍历
*/

//////////森林的遍历////////////////////////////
/*   对每一棵树进行遍历*/


//****************************************************************************************//